:PROPERTIES:
:ID: 11E13D6C-39EE-445A-A758-1DEA7E83D589
:END:
#+title: Get
#+description: Get
#+type: recipe
#+level: cross
#+filetags: :recipe:shell:countries:
#+created: 2026-05-21
#+updated: 2026-06-25

Get all countries in the system. Login is required — =countries get= sends an
authenticated NATS request so the service can scope results to the logged-in
tenant.

#+name: countries-get
#+begin_src ores-shell :exports none
countries get
exit
#+end_src

#+begin_src sh :noweb yes :results output :wrap example
printf 'countries get\nexit\n' | ./compass.sh shell -u 'tenant_admin@barclays_plc' -p 'Secure-Password-123' 2>&1 | head -25
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to nats://localhost:42230
✓ Logged in as: tenant_admin
  Tenant:  (36d4c3c9-195c-46b5-a4d8-b36cb48c8f46)
ORE Studio Shell REPL v0.0.21
Type 'help' for available commands, 'exit' to quit.

ores-shell> +---------+---------+---------+---------+------------------------+---------------------------------+-----------------------------+-----------------------------------+-------------------------------+
| Alpha-2 | Alpha-3 | Numeric | Version | Name                   | Official Name                   | Change Reason               | Modified By                       | Recorded At                   |
+---------+---------+---------+---------+------------------------+---------------------------------+-----------------------------+-----------------------------------+-------------------------------+
| AE      | ARE     | 784     | 1       | United Arab Emirates   | United Arab Emirates            | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AF      | AFG     | 004     | 1       | Afghanistan            | Islamic Republic of Afghanistan | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AG      | ATG     | 028     | 1       | Antigua and Barbuda    | Antigua and Barbuda             | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AI      | AIA     | 660     | 1       | Anguilla               | Anguilla                        | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AL      | ALB     | 008     | 1       | Albania                | Republic of Albania             | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AM      | ARM     | 051     | 1       | Armenia                | Republic of Armenia             | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AO      | AGO     | 024     | 1       | Angola                 | Republic of Angola              | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AQ      | ATA     | 010     | 1       | Antarctica             | Antarctica                      | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AR      | ARG     | 032     | 1       | Argentina              | Argentine Republic              | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AS      | ASM     | 016     | 1       | American Samoa         | American Samoa                  | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AT      | AUT     | 040     | 1       | Austria                | Republic of Austria             | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AU      | AUS     | 036     | 1       | Australia              | Commonwealth of Australia       | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AW      | ABW     | 533     | 1       | Aruba                  | Aruba                           | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
| AD      | AND     | 020     | 1       | Andorra                | Principality of Andorra         | system.external_data_import | ores_prime_origin_refdata_service | 2026-06-25 10:13:26.000000000 |
+---------+---------+---------+---------+------------------------+---------------------------------+-----------------------------+-----------------------------------+-------------------------------+

Page 1 of 3 (14 of 249 total)
ores-shell> Bye!
#+end_example
